#include <stdio.h> // підключення бібліотеки вводу-виводу

int main() {
    char surname[20]; // оголошення змінної для зберігання прізвища
    char name[20]; // оголошення змінної для зберігання імені
    char patronymic[20]; // оголошення змінної для зберігання по-батькові

    printf("Введіть прізвище: "); // виведення запиту на введення прізвища
    scanf("%s", surname); // зчитування прізвища з консолі

    printf("Введіть ім'я: "); // виведення запиту на введення імені
    scanf("%s", name); // зчитування імені з консолі

    printf("Введіть по-батькові: "); // виведення запиту на введення по-батькові
    scanf("%s", patronymic); // зчитування по-батькові з консолі

    printf("%c. %c. %c.\n", surname[0], name[0], patronymic[0]); // виведення ініціалів з крапками

    return 0;
}
