#include <stdio.h>
#include <stdlib.h> // для функції rand() та srand()
#include <time.h>   // для функції time()

int main() {
    // Ініціалізуємо генератор випадкових чисел використовуючи поточний час як насіння.
    srand(time(NULL));
    
    // Генеруємо випадкове число в діапазоні від 1 до 100.
    int secret_number = rand() % 100 + 1;
    
    // Лічильник спроб.
    int num_guesses = 0;
    
    // Цикл з обмеженням на кількість спроб.
    while (num_guesses < 5) {
        // Запитуємо користувача ввести число.
        printf("Спроба %d. Введіть число від 1 до 100: ", num_guesses+1);
        int guess;
        scanf("%d", &guess);
        
        // Перевіряємо, чи відгадав користувач число.
        if (guess == secret_number) {
            printf("Вітаємо! Ви відгадали число %d за %d спроб!\n", secret_number, num_guesses+1);
            return 0;
        }
        
        // Якщо число відгадане не вірно, виводимо підказку.
        if (guess < secret_number) {
            printf("Задумане число більше за введене.\n");
        } else {
            printf("Задумане число менше за введене.\n");
        }
        
        // Збільшуємо лічильник спроб на 1.
        num_guesses++;
    }
    
    // Якщо користувач не відгадав число за 5 спроб, виводимо повідомлення про поразку та задумане число.
    printf("На жаль, ви не відгадали число %d за 5 спроб. Спробуйте ще раз!\n", secret_number);
    return 0;
}

