#include <stdio.h>

int main() {
    int year;
    printf("¬вед≥ть р≥к: ");
// використовуЇмо функц≥ю scanf() дл€ зчитуванн€ року, введеного користувачем
    scanf("%d", &year);
//якщо р≥к д≥литьс€ на 4 ≥ не д≥литьс€ на 100, то в≥н Ї високосним.
//якщо р≥к д≥литьс€ на 400, то в≥н Ї високосним.
  
    if ((year % 4 == 0 && year % 100 != 0) || year % 400 == 0) {
        printf("%d - високосний р≥к", year);
    } else {
        printf("%d - не високосний р≥к", year);
    }
//якщо р≥к Ї високосним, то програма виводить пов≥домленн€ "р≥к - високосний р≥к".
//якщо р≥к Ї не високосним, то програма виводить пов≥домелнн€ "р≥к - не високосний р≥к"
    return 0;
}


